codeigniter4-framework-b3359be/app/Controllers/UserController.php

    public function login()
    {
        $session      = session();
        $userModel    = new UserModel();
        $prefixeModel = new PrefixeModel();

        // Récupération sécurisée du champ "phone" envoyé en POST
        $numeroSaisi = $this->request->getPost('phone');

        if (empty($numeroSaisi)) {
            $session->setFlashdata('error', 'Veuillez entrer votre numero de telephone.');
            return redirect()->to('/login');
        }

        // Nettoyage complet du numéro (uniquement des chiffres)
        $cleanNumber = preg_replace('/[^0-9]/', '', $numeroSaisi);

        if (strlen($cleanNumber) < 4) {
            $session->setFlashdata('error', 'Numero de telephone invalide.');
            return redirect()->to('/login');
        }

        // 1. EXTRACTION ET VÉRIFICATION DU PRÉFIXE (ex: "034", "032")
        $prefixeSaisi = substr($cleanNumber, 0, 3);

        // On cherche si ce préfixe existe dans la table 'prefixe'
        $prefixeExiste = $prefixeModel->where('nom', $prefixeSaisi)->first();
---
SELECT *
FROM `prefixe`
WHERE `nom` = '033'
 LIMIT 1