codeigniter4-framework-b3359be/app/Models/TransactionModel.php

INSERT INTO `transactions` (`id_type`, `montant`, `date`, `id1`, `id2`, `idMontant_frai`) VALUES (2, 100, '2026-07-20 18:48:58', 3, NULL, NULL)
---
    public function enregistrerDepot(int $idUser, float $montant): int
    {
        return (int) $this->insert([
            'id_type'        => self::TYPE_DEPOT,
            'montant'        => $montant,
            'date'           => date('Y-m-d H:i:s'),
            'id1'            => $idUser,
            'id2'            => null,
            'idMontant_frai' => null,
        ]);

INSERT INTO `transactions` (`id_type`, `montant`, `date`, `id1`, `id2`, `idMontant_frai`) VALUES (3, 1000, '2026-07-20 18:51:42', 1, 2, 11)
---
    public function enregistrerTransfert(int $idEmetteur, int $idDestinataire, float $montant, ?int $idMontantFrai): int
    {
        return (int) $this->insert([
            'id_type'        => self::TYPE_TRANSFERT,
            'montant'        => $montant,
            'date'           => date('Y-m-d H:i:s'),
            'id1'            => $idEmetteur,
            'id2'            => $idDestinataire,
            'idMontant_frai' => $idMontantFrai,
        ]);