codeigniter4-framework-b3359be/app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `prefixe` = '033'
AND `sufixe` = '4445566'
 LIMIT 1
---
    public function getUserByPhoneNumber($phoneNumber)
    {
        [$prefixeRecherche, $sufixeRecherche] = self::splitPhoneNumber($phoneNumber);

        return $this->where('prefixe', $prefixeRecherche)
                    ->where('sufixe', $sufixeRecherche)
                    ->first();

INSERT INTO `user` (`prefixe`, `sufixe`, `nom`) VALUES ('033', '4445566', '0334445566')
---
    public function getOrCreateUserByPhoneNumber(string $phoneNumber)
    {
        $existing = $this->getUserByPhoneNumber($phoneNumber);
        if ($existing) {
            return $existing;
        }

        [$prefixe, $sufixe] = self::splitPhoneNumber($phoneNumber);

        if ($prefixe === '' || $sufixe === '') {
            return null;
        }

        $id = $this->insert([
            'prefixe' => $prefixe,
            'sufixe'  => $sufixe,
            'nom'     => $prefixe . $sufixe,
        ]);